<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>CPU</title>
<style type="text/css">
<!--
.Estilo1 {
	font-family: "Times New Roman", Times, serif;
	font-size: 24px;
	color: #006666;
}
.Estilo2 {
	color: #006666;
	font-family: "Times New Roman", Times, serif;
	font-size: 12px;
}
.Estilo3 {
	font-family: "Times New Roman", Times, serif;
	font-size: 12px;
}
.Estilo4 {
	color: #006666;
	font-size: 18px;
}
.Estilo6 {color: #006666; font-size: 12px; }
.Estilo7 {color: #006666}
.Estilo9 {font-size: 12px}
.Estilo10 {font-size: 9px; font-weight: bold; color: #006666; }
body {
	background-image: url(Fondo%20Negro.jpg);
}
.Estilo11 {color: #006666; font-family: "Times New Roman", Times, serif; font-size: 18px; font-weight: bold; }
-->
</style>
</head>

<body>
<table width="969" height="3370" border="0" bordercolor="#000000">
  <tr>
    <th width="959" height="3364" scope="col"><p class="Estilo1">3.- CPU <strong>(C</strong>entral <strong>P</strong>rocessing <strong>U</strong>nit)</p>
      <p><img src="Imagen CPU 1.jpg" width="333" height="211"> </p>
      <table width="897" height="2932" border="0" bordercolor="#000000">
        <tr>
          <th width="112" height="1867" scope="col">&nbsp;</th>
          <th width="675" scope="col"><p align="justify" class="Estilo11">Concepto.</p>
              <p align="justify" class="Estilo2"><br>
                <span class="Estilo6">    La <strong>Unidad Central de Procesamiento</strong> o simplemente el <strong>procesador</strong>, es el componente en una computadora digital  que interpreta las instrucciones y procesa los datos contenidos en los  programas de la computadora. Las CPU proporcionan la caracter&iacute;stica fundamental  de la computadora digital (la programabilidad) y son uno de los componentes  necesarios encontrados en las computadoras de cualquier tiempo, junto con el  almacenamiento primario y los dispositivos de entrada/salida. Se conoce como  microprocesador el CPU que es manufacturado con circuitos integrados. Desde  mediados de los a&ntilde;os 1970, los microprocesadores de un solo chip han  reemplazado casi totalmente todos los tipos de CPU, y hoy en d&iacute;a, el t&eacute;rmino  &quot;CPU&quot; es aplicado usualmente a todos los microprocesadores.</span></p>
              <p align="justify" class="Estilo6"><br>
  La expresi&oacute;n &quot;unidad central de proceso&quot;  es, en t&eacute;rminos generales, una descripci&oacute;n de una cierta clase de m&aacute;quinas de  l&oacute;gica que pueden ejecutar complejos programas de computadora. Esta amplia  definici&oacute;n puede f&aacute;cilmente ser aplicada a muchos de los primeros ordenadores  que existieron mucho antes que el t&eacute;rmino &quot;CPU&quot; estuviera en amplio  uso. Sin embargo, el t&eacute;rmino en s&iacute; mismo y su acr&oacute;nimo han estado en uso en la  industria de la inform&aacute;tica por lo menos desde el principio de los a&ntilde;os 1960 .  La forma, el dise&ntilde;o y la implementaci&oacute;n de las CPU ha cambiado dr&aacute;sticamente  desde los primeros ejemplos, pero su operaci&oacute;n fundamental ha permanecido  bastante similar.<br>
  Las primeras CPU fueron dise&ntilde;adas a la medida como  parte de una computadora m&aacute;s grande, generalmente una computadora &uacute;nica en su  especie. Sin embargo, este costoso m&eacute;todo de dise&ntilde;ar los CPU a la medida, para  una aplicaci&oacute;n particular, ha desaparecido en gran parte y se ha sustituido por  el desarrollo de clases de procesadores baratos y estandarizados adaptados para  uno o muchos prop&oacute;sitos. Esta tendencia de estandarizaci&oacute;n comenz&oacute; generalmente  en la era de los transistores discretos, computadoras centrales, y  microcomputadoras, y fue acelerada r&aacute;pidamente con la popularizaci&oacute;n del  circuito integrado (IC), &eacute;ste ha permitido que sean dise&ntilde;ados y fabricados CPU  m&aacute;s complejos en espacios peque&ntilde;os (en la orden de mil&iacute;metros). Tanto la  miniaturizaci&oacute;n como la estandarizaci&oacute;n de los CPU han aumentado la presencia  de estos dispositivos digitales en la vida moderna mucho m&aacute;s all&aacute; de las  aplicaciones limitadas de m&aacute;quinas de computaci&oacute;n dedicadas. Los  microprocesadores modernos aparecen en todo, desde autom&oacute;viles, televisores,  neveras, calculadoras, aviones, hasta tel&eacute;fonos m&oacute;viles o celulares, juguetes,  entre otros.</p>
            <p align="justify" class="Estilo11">Historia </p>
                  
              <div align="left" class="Estilo3">
                <div align="justify" class="Estilo6">Todos los  CPU tratan con estados discretos, y por lo tanto requieren una cierta clase de  elementos de conmutaci&oacute;n para diferenciar y cambiar estos estados. Antes de la  aceptaci&oacute;n comercial del transistor, los rel&eacute;s el&eacute;ctricos y los tubos de vac&iacute;o  (v&aacute;lvulas termoi&oacute;nicas) eran usados com&uacute;nmente como elementos de conmutaci&oacute;n.  Aunque &eacute;stos ten&iacute;an distintas ventajas de velocidad sobre los anteriores  dise&ntilde;os puramente mec&aacute;nicos, no eran fiables por varias razones. Por ejemplo,  hacer circuitos de l&oacute;gica secuencial de corriente directa requer&iacute;a hardware  adicional para hacer frente al problema del rebote de contacto. Por otro lado,  mientras que los tubos de vac&iacute;o no sufren del rebote de contacto, &eacute;stos deben  calentarse antes de llegar a estar completamente operacionales y eventualmente  fallan y dejan de funcionar por completo.  Generalmente, cuando un tubo ha fallado, el CPU tendr&iacute;a que ser diagnosticado  para localizar el componente que falla para que pueda ser reemplazado. Por lo  tanto, los primeros computadores electr&oacute;nicos, (basados en tubos de vac&iacute;o),  generalmente eran m&aacute;s r&aacute;pidas pero menos confiables que las computadoras  electromec&aacute;nicas, (basadas en rel&eacute;s). Las computadoras de tubo, como el EDVAC,  tendieron en tener un promedio de ocho horas entre fallas, mientras que las  computadoras de rel&eacute;s, (anteriores y m&aacute;s lentas), como el Harvard Mark I,  fallaban muy raramente. Al final, los CPU basados en tubo llegaron a ser  dominantes porque las significativas ventajas de velocidad producidas  generalmente pesaban m&aacute;s que los problemas de confiabilidad. La mayor parte de  estos tempranos CPU s&iacute;ncrono corr&iacute;an en frecuencias de reloj bajas comparadas  con los modernos dise&ntilde;os microelectr&oacute;nicos, (ver m&aacute;s abajo para una exposici&oacute;n  sobre la frecuencia de reloj). Eran muy comunes en este tiempo las frecuencias  de la se&ntilde;al del reloj con un rango desde 100 kHz hasta 4 MHz, limitado en gran  parte por la velocidad de los dispositivos de conmutaci&oacute;n con los que fueron  construidos. </div>
                <p align="justify" class="Estilo4">Estructura.</p>
                <table width="647" border="0" bordercolor="#000000">
                  <tr>
                    <th width="50" scope="col">&nbsp;</th>
                    <th width="550" scope="col"><img src="Arquitectura del Hardware.JPG" width="550" height="263"></th>
                    <th width="9" scope="col">&nbsp;</th>
                  </tr>
                </table>
                <p align="justify" class="Estilo6">Partiendo del esquema b&aacute;sico del hardware se puede observar la estructrura de la CPU la cual esta formada por:</p>
                <div align="justify" class="Estilo7">
                  <ul class="Estilo9">
                    <li class="Estilo6">Una Unidad de Control (CU, Control Unit). Es la parte del procesador encargada de gobernar al resto de las unidades, ademas de interpretar y ejecutar las instrucciones controlando su secuencia.</li>
                  </ul>
                  <ul>
                    <li class="Estilo6">Unidad Aritmetico-L&oacute;gica (ALU, Arithmetic-Logical Unit). Es la parte del procesador encargada de realizar todas las operaciones elementales de tipo aritm&eacute;tico y de tipo l&oacute;gica.</li>
                  </ul>
                  <ul>
                    <li><span class="Estilo6">Memoria Principal (CM, Central Memory). Tambien es conocida como memoria RAM. Es la que se encarga de almacenar los programas y datos necesarios para que el sistema inform&aacute;tico realice un determinado trabajo.</span> </li>
                  </ul>
                </div>
                <h2 align="justify" class="Estilo11">Operaci&oacute;n del CPU </h2>
                <p align="justify" class="Estilo7"><span class="Estilo6">La operaci&oacute;n fundamental de la mayor&iacute;a de los CPU, es ejecutar una secuencia  de instrucciones almacenadas llamadas &quot;programa&quot;. El programa es  representado por una serie de n&uacute;meros que se mantienen en una cierta clase de  memoria de computador. Hay cuatro pasos que casi todos los CPU de arquitectura  de Von Neumann usan en su operaci&oacute;n: <strong>fetch</strong>, <strong>decode</strong>, <strong>execute</strong>,  y <strong>writeback</strong>, (leer, decodificar, ejecutar, y escribir).</span><br>
                </p>
                <table width="675" border="0" bordercolor="#000000">
                  <tr>
                    <th width="65" height="234" scope="col">&nbsp;</th>
                    <th width="543" scope="col"><p><img src="Imagen página CPU 3.JPG" width="410" height="184"></p>
                        <p class="Estilo10">Diagrama mostrando como es decodificada una instrucci&oacute;n del  MIPS32. (MIPS Technologies 2005)</p></th>
                    <th width="45" scope="col">&nbsp;</th>
                  </tr>
                </table>
                <p align="justify" class="Estilo6">El primer paso, <strong>leer</strong> (fetch), implica el recuperar una instrucci&oacute;n,  (que es representada por un n&uacute;mero o una secuencia de n&uacute;meros) de la memoria de  programa. La localizaci&oacute;n en la memoria del programa es determinada por un contador  de programa (PC), que almacena un n&uacute;mero que identifica la posici&oacute;n actual en  el programa. En otras palabras, el contador de programa indica al CPU, el lugar  de la instrucci&oacute;n en el programa actual. Despu&eacute;s de que se lee una instrucci&oacute;n,  el PC es incrementado por la longitud de la palabra de instrucci&oacute;n en t&eacute;rminos  de unidades de memoria.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </p>
                <p align="justify" class="Estilo6">Frecuentemente la  instrucci&oacute;n a ser le&iacute;da debe ser recuperada de memoria relativamente lenta,  haciendo detener al CPU mientras espera que la instrucci&oacute;n sea retornada. Este  problema es tratado en procesadores modernos en gran parte por los cach&eacute;s y las  arquitecturas pipeline.</p>
                <p align="justify" class="Estilo6"><span class="Estilo6"><br>
  La instrucci&oacute;n que el CPU lee desde la memoria es usada para determinar qu&eacute;  deber&aacute; hacer el CPU. En el paso de <strong>decodificaci&oacute;n</strong>, la instrucci&oacute;n es  dividida en partes que tienen significado para otras porciones del CPU. La  manera en que el valor de la instrucci&oacute;n num&eacute;rica es interpretado est&aacute; definida  por la arquitectura del conjunto de instrucciones (el <strong>ISA</strong>) del CPU. A  menudo, un grupo de n&uacute;meros en la instrucci&oacute;n, llamado opcode, indica qu&eacute;  operaci&oacute;n realizar. Las partes restantes del n&uacute;mero usualmente proporcionan  informaci&oacute;n requerida para esa instrucci&oacute;n, como por ejemplo, operandos para  una operaci&oacute;n de adici&oacute;n. Tales operandos se pueden dar como un valor constante  (llamado valor inmediato), o como un lugar para localizar un valor, que seg&uacute;n  lo determinado por alg&uacute;n modo de direcci&oacute;n, puede ser un registro o una direcci&oacute;n  de memoria. En dise&ntilde;os m&aacute;s viejos las porciones del CPU responsables de  decodificar la instrucci&oacute;n eran dispositivos de hardware fijos. Sin embargo, en  CPUs e ISAs m&aacute;s abstractos y complicados, es frecuentemente usado un microprograma  para asistir en traducir instrucciones en varias se&ntilde;ales de configuraci&oacute;n para  el CPU. Este microprograma a veces se puede reescribir de tal manera que puede  ser modificado para cambiar la manera en que el CPU decodifica instrucciones  incluso despu&eacute;s de que haya sido fabricado.</span><br>
                </p>
                <div align="justify">
                  <table width="641" border="0" bordercolor="#000000">
                    <tr>
                      <th width="189" class="Estilo6" scope="col">&nbsp;</th>
                      <th width="283" class="Estilo6" scope="col"><p><img src="Imagen página CPU 4.JPG" width="258" height="357"></p>
                          <p><strong>Diagrama de bloques de un CPU simple</strong></p></th>
                      <th width="147" class="Estilo6" scope="col">&nbsp;</th>
                    </tr>
                  </table>
                </div>
                <p align="justify" class="Estilo6">Despu&eacute;s de los pasos de lectura y decodificaci&oacute;n, es llevado a cabo el paso  de la ejecuci&oacute;n de la  instrucci&oacute;n. Durante este paso, varias porciones del CPU son conectadas de tal  manera que ellas pueden realizar la operaci&oacute;n deseada. Si, por ejemplo, una  operaci&oacute;n de adici&oacute;n fue solicitada, una unidad aritm&eacute;tico l&oacute;gica (<strong>ALU</strong>)  ser&aacute; conectada a un conjunto de entradas y un conjunto de salidas. Las entradas  proporcionan los n&uacute;meros a ser sumados, y las salidas contendr&aacute;n la suma final.  El ALU contiene la circuiter&iacute;a para realizar operaciones simples de aritm&eacute;tica  y l&oacute;gica en las entradas, como adici&oacute;n y operaciones de bits (bitwise). Si la  operaci&oacute;n de adici&oacute;n produce un resultado demasiado grande para poder ser  manejado por el CPU, tambi&eacute;n puede ser ajustada una bandera (flag) de desbordamiento  aritm&eacute;tico localizada en un registro de banderas.</p>
                <p align="justify" class="Estilo6"><br>
                  El paso final, la <strong>escritura</strong> (writeback), simplemente  &quot;escribe&quot; los resultados del paso de ejecuci&oacute;n a una cierta forma de  memoria. Muy a menudo, los resultados son escritos a alg&uacute;n registro interno del  CPU para acceso r&aacute;pido por subsecuentes instrucciones. En otros casos los  resultados pueden ser escritos a una memoria principal m&aacute;s lenta pero m&aacute;s  barata y m&aacute;s grande. Algunos tipos de instrucciones manipulan el contador de  programa en lugar de directamente producir datos de resultado. &Eacute;stas son  llamadas generalmente &quot;saltos&quot; (jumps) y facilitan comportamientos  como bucles (loops), la ejecuci&oacute;n condicional de programas (con el uso de  saltos condicionales), y funciones en programas.[] Muchas instrucciones tambi&eacute;n  cambiar&aacute;n el estado de d&iacute;gitos en un registro de &quot;banderas&quot;. Estas  banderas pueden ser usadas para influenciar c&oacute;mo se comporta un programa,  puesto que a menudo indican el resultado de varias operaciones. Por ejemplo, un  tipo de instrucci&oacute;n de &quot;comparaci&oacute;n&quot; considera dos valores y fija un  n&uacute;mero, en el registro de banderas, de acuerdo a cual es el mayor. Entonces,  esta bandera puede ser usada por una posterior instrucci&oacute;n de salto para  determinar el flujo de programa.</p>
                <p align="justify" class="Estilo6"><br>
                  Despu&eacute;s de la ejecuci&oacute;n de la instrucci&oacute;n y la escritura de los datos  resultantes, el proceso entero se repite con el siguiente ciclo de instrucci&oacute;n,  normalmente leyendo la siguiente instrucci&oacute;n en secuencia debido al valor  incrementado en el contador de programa. Si la instrucci&oacute;n completada era un  salto, el contador de programa ser&aacute; modificado para contener la direcci&oacute;n de la  instrucci&oacute;n a la cual se salt&oacute;, y la ejecuci&oacute;n del programa contin&uacute;a  normalmente. En CPUs m&aacute;s complejos que el descrito aqu&iacute;, m&uacute;ltiples  instrucciones pueden ser le&iacute;das, decodificadas, y ejecutadas simult&aacute;neamente.  Esta secci&oacute;n describe lo que es referido generalmente como el &quot;entubado  RISC cl&aacute;sico&quot; (Classic RISC pipeline), que de hecho es bastante com&uacute;n  entre los CPU simples usados en muchos dispositivos electr&oacute;nicos, a menudo  llamados microcontroladores.</p>
                <p align="justify" class="Estilo6">&nbsp;</p>
                <table width="657" border="0" bordercolor="#000000">
                  <tr>
                    <th width="444" class="Estilo6" scope="col"><div align="left"><a href="Página Principal.html">Volver a la P&aacute;gina Principal </a></div></th>
                    <th width="102" scope="col"><span class="Estilo6"><a href="Tarjeta Madre.html">Anterior</a></span></th>
                    <th width="87" bordercolor="#FFFFFF" class="Estilo6" scope="col"><a href="Memoria RAM.html">Siguiente</a></th>
                  </tr>
                </table>
                <p align="justify" class="Estilo6">&nbsp;</p>
              </div></th>
          <th width="88" scope="col">&nbsp;</th>
        </tr>
      </table>      <p>&nbsp;</p></th>
  </tr>
</table>
</body>
</html>
