
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Disco Duro</title>
<style type="text/css">
<!--
.Estilo1 {
	font-family: "Times New Roman", Times, serif;
	font-size: 12px;
	color: #006666;
}
.Estilo3 {
	font-size: 18px;
	font-weight: bold;
}
.Estilo4 {font-family: "Times New Roman", Times, serif; font-size: 18px; color: #006666; }
.Estilo5 {
	font-family: "Times New Roman", Times, serif;
	font-size: 24px;
	color: #006666;
	font-weight: bold;
}
.Estilo8 {font-size: 18px}
.Estilo9 {
	color: #006666;
	font-weight: bold;
}
body {
	background-image: url(Fondo%20Negro.jpg);
}
-->
</style>
</head>

<body>
<table width="972" border="0" bordercolor="#000000">
  <tr>
    <th width="192" scope="col">&nbsp;</th>
    <th width="596" scope="col"><p class="Estilo5">&nbsp;</p>
      <p class="Estilo5">8.- Disco Duro</p>
      <p class="Estilo1"><img src="clip_image002_0000.jpg" width="204" height="148"></p>
      <p class="Estilo1"><strong>&nbsp;&nbsp;</strong></p>
      <p align="justify" class="Estilo4"><strong>Introducci&oacute;n</strong>.</p>
      <p align="justify" class="Estilo1"><br />
        Los discos duros son  en la actualidad los dispositivos de almacenamiento masivo por excelencia en  los PCs, hasta el punto en que se han convertido en un componente casi  indispensable. Sin los discos duros y la evoluci&oacute;n que estos han tenido tanto  en velocidad como en capacidad, probablemente hoy no podr&iacute;amos encender nuestro  equipo y en unos segundos tener listos para trabajar nuestros programas y  sistemas operativos preferidos. Desde los primeros discos duros, de capacidades  de 10 o incluso 20 Megabytes, hemos llegado superar m&aacute;s de 10.00 veces al primer  Winchester. El que hoy sea habitual que un equipo domestico cuente con discos  duros de 40 u 80 Gigabytes ha condicionado en gran medida la evoluci&oacute;n del  software y las aplicaciones a las que se dedican los PCs. Hace 15 a&ntilde;os  est&aacute;bamos orgullosos de poder arrancar nuestro PC desde un disquete de 5&frac14;,  obtener la interfaz de texto de MS-DOS 3.0 y escribir una carta en texto plano  sobre una pantalla negra. Y todo ello en un ordenador que posiblemente no  contaba con un disco duro. Hoy tenemos sistemas operativos mucho m&aacute;s complejos,  interfaces gr&aacute;ficas que hacen accesibles los PCs a usuarios con menos  experiencia, programas capaces de interactuar con el usuario para conseguir que  realice su trabajo o simplemente entretenerle... todo esto se apoya  directamente sobre la gran capacidad que ofrecen los discos actuales.</p>
      <p align="justify" class="Estilo1">&nbsp;</p>
      <p align="justify" class="Estilo1"><span class="Estilo3">Concepto.</span></p>
      <p align="justify" class="Estilo1"><br />
        Un disco duro es un  dispositivo de almacenamiento no vol&aacute;til, que conserva la informaci&oacute;n aun con  la p&eacute;rdida de energ&iacute;a, que emplea un sistema de grabaci&oacute;n magn&eacute;tica digital; es  donde en la mayor&iacute;a de los casos se encuentra almacenado el sistema operativo  de la computadora. Dentro de la carcasa hay una serie de platos met&aacute;licos  apilados girando a gran velocidad. Sobre los platos se sit&uacute;an los cabezales  encargados de leer o escribir los impulsos magn&eacute;ticos. Hay distintos est&aacute;ndares  para comunicar un disco duro con la computadora; los interfaces m&aacute;s comunes son <em>Integrated Drive Electronics</em> (IDE, tambi&eacute;n llamado ATA) , SCSI  generalmente usado en servidores, SATA, este &uacute;ltimo estandarizado en el a&ntilde;o 2004  y FC exclusivo para servidores.</p>
      <p align="justify" class="Estilo1"><span class="Estilo3">Historia.</span></p>
      <p align="justify" class="Estilo1"><br />
        La leyenda del disco  duro parece remontarse a 1952, a&ntilde;o en el que IBM crea en San Jos&eacute; (California)  el primer laboratorio dedicado exclusivamente a la investigaci&oacute;n y desarrollo  de dispositivos de almacenamiento. A la cabeza de este proyecto se encontraba  Reynold Johnson, ingeniero de la conocida marca que ya destacaba en la  invenci&oacute;n de dispositivos mec&aacute;nicos y electromagn&eacute;ticos (inventor de los  primeros correctores autom&aacute;ticos de ex&aacute;menes). La idea de un dispositivo magn&eacute;tico  de almacenamiento consistente en una superficie giratoria y una cabeza que  pudiera leer y escribir impulsos magn&eacute;ticos sobre ella comenzaba aqu&iacute;.  Aproximadamente dos a&ntilde;os despu&eacute;s Johnson completaba este proyecto, que  originalmente (y como casi todo en la inform&aacute;tica hace unos a&ntilde;os) s&oacute;lo  beneficiaria a los militares estadounidenses. El RAMAC (&ldquo;Random Access Method  of Accounting and Control&rdquo;) fue el primer disco duro de la historia de la  inform&aacute;tica. Contaba con 50 platos de 24 pulgadas de di&aacute;metro  que giraban a una velocidad de 1200 rpm, un tiempo de acceso medio de 1 segundo  y la entonces incre&iacute;ble capacidad de 5 megabytes. Gracias a este dispositivo y  las mejoras que realizar&iacute;a algunos a&ntilde;os m&aacute;s tarde (el RAMAC-350), Johnson se  har&iacute;a merecedor de diversos premios. &ldquo;International  Historic Mechanical Engineering Landmark&rdquo; en 1984, la &ldquo;National Medal of  Technology&rdquo; en 1986 y el &ldquo;Award for the Advancement of Information Storage  Technology&rdquo; en 1992. En 1973 aparece la tecnolog&iacute;a de disco Winchester, cuyos 30 MB con 30  ms de tiempo medio de acceso consiguieron que sus creadores le dieran el nombre  del conocido rifle. Desde entonces, la evoluci&oacute;n del disco duro ha tendido  hacia la miniaturizaci&oacute;n, el aumento de capacidad y la mayor velocidad. Y no  s&oacute;lo desde el punto de vista electromagn&eacute;tico. Hoy en d&iacute;a la aerodin&aacute;mica e  incluso la mec&aacute;nica cu&aacute;ntica son claves en la fabricaci&oacute;n de un disco.</p>
      <p align="justify" class="Estilo1"><br />
        La capacidad se ha  visto aumentada a la vez que reduc&iacute;an el numero de platos que compon&iacute;an un  &uacute;nico disco duro gracias a que en la actualidad, la tecnolog&iacute;a de los discos  nos permite almacenar mucha m&aacute;s informaci&oacute;n en menos superficie. De un disco de  171 MB con dos platos de 3,5   pulgadas que pod&iacute;a almacenar 38400 bits por pulgada,  hemos pasado a discos de 60 GB que en el mismo n&uacute;mero de platos del mismo  tama&ntilde;o llegan a almacenar mas de 540 MB por pulgada.<br />
        La velocidad tambi&eacute;n  ha aumentado espectacularmente. Mientras que nuestro disco de 171 MB giraba a  3800 rpm, el de 60 GB gira a 7200 RPM y puede alcanzar velocidades de transferencia  de hasta 100 MB/s.  </p>
      <p align="justify" class="Estilo1"><span class="Estilo8"><strong>Partes de un Disco  Duro y su Funcionamiento</strong>.</span></p>
      <p align="justify" class="Estilo1">En este apartado  describiremos tanto las piezas principales de las que se compone un disco duro,  como la estructura interna que permite el almacenamiento de datos de forma  organizada.<br />
          <strong>Componentes  f&iacute;sicos del disco duro</strong></p>
      <p align="justify" class="Estilo1">Al hablar de los  componentes f&iacute;sicos de un disco, debemos mencionar el car&aacute;cter mec&aacute;nico de  este. Pues se trata de uno de los pocos componentes de un PC que consta de  partes mec&aacute;nicas y no solas electr&oacute;nicas.</p>
      <p align="justify" class="Estilo1">Como idea general,  podemos decir que los discos duros est&aacute;n formados por varios platos que giran  sobre un eje central y por unas cabezas de lectura/escritura capaces de  desplazarse sobre el disco, las cuales codifican la informaci&oacute;n a grabar en  forma de impulsos magn&eacute;ticos o descodifican estos impulsos previamente  registrados en los platos para extraer nuestros archivos. Entre los componentes  f&iacute;sicos, podemos distinguir cinco elementos principales en un disco duro:</p>
      <p align="justify" class="Estilo1"><strong>Platos:</strong> Se trata de c&iacute;rculos  (discos) met&aacute;licos, normalmente de aluminio, finamente pulidos y recubiertos de  una delgada aleaci&oacute;n met&aacute;lica con propiedades magn&eacute;ticas. Estos platos se  encuentran instalados sobre un eje central. Con la evoluci&oacute;n de los discos, el  n&uacute;mero de platos se ha ido reduciendo a 1 o 2 como m&aacute;ximo en los dispositivos  actuales.</p>
      <p align="justify" class="Estilo1"><strong>Eje / Motor:</strong> Realiza las  funciones de soporte de los platos y uni&oacute;n de los mismos con un motor que los  hace girar a velocidades angulares constantes de hasta 10.000 e incluso 15.000  revoluciones por minuto en los discos duros SCSI mas modernos.</p>
      <p align="justify" class="Estilo1"><span class="Estilo9">Cabezas</span>: Son las encargadas  de la lectura y escritura de datos sobre la superficie del disco. Est&aacute;n  situadas en el extremo de peque&ntilde;os brazos que se encuentran por encima y por  debajo de cada plato del disco duro. Las cabezas son uno de los componentes m&aacute;s  delicados del disco, ya que se encuentran planeando a distancias aproximadas de  0,0003 mm  sobre los platos; de ah&iacute; que cualquier golpe pueda acabar con la vida de  nuestro disco. Normalmente los discos duros cuentan con dos cabezas por plato  que se desplazan a la vez por medio de un &uacute;nico actuador o resorte, pero en  discos de gama alta podr&iacute;an encontrarse cuatro cabezas, de forma que a cada una  le corresponde solo la mitad del radio del disco, consiguiendo as&iacute; un menor tiempo  de b&uacute;squeda.</p>
      <p align="justify" class="Estilo1"><strong>Actuador / Impulsor</strong>: Es el sistema que  mueve la estructura de las cabezas a lo ancho de la superficie de los platos.  Su funcionamiento est&aacute; basado en un electroim&aacute;n que al recibir mayor o menor  corriente consigue alinear con precisi&oacute;n las cabezas sobre la pista concreta  que vaya a leerse o grabarse.</p>
      <p align="justify" class="Estilo1"><strong>Circuiter&iacute;a /  Controladora</strong>: Se encarga del control de la unidad, y est&aacute; situada en la parte  inferior de la carcasa de un disco. Su misi&oacute;n principal es la conversi&oacute;n de las  se&ntilde;ales digitales conque trabaja el ordenador, a los impulsos el&eacute;ctricos  capaces de ser almacenados por el disco.</p>
      <p align="justify" class="Estilo1"><img src="clip_image004_0000.jpg" width="492" height="284" hspace="100"></p>
      <p align="justify" class="Estilo1"><span class="Estilo3">Estructura F&iacute;sica / L&oacute;gica.</span></p>
      <p align="justify" class="Estilo1"><br />
      La estructura f&iacute;sica  de la superficie de un disco duro es variable seg&uacute;n las marcas y modelos. S&oacute;lo  la propia controladora de la unidad sabe exactamente cual es la traducci&oacute;n que  debe aplicar sobre los par&aacute;metros l&oacute;gicos que se muestran al ordenador. Es  decir, los par&aacute;metros f&iacute;sicos del disco (aquellos que utiliza internamente la  controladora) rara vez coinciden con sus correspondientes l&oacute;gicos (aquellos que  el disco muestra al ordenador). Pero ya sea f&iacute;sica o l&oacute;gicamente, el disco est&aacute;  estructurado mediante un serie de divisiones de su superficie, mediante las  cuales se consigue que los datos se almacenen en zonas concretas y que se  conozca cual es la localizaci&oacute;n de los mismos para permitir ser le&iacute;dos m&aacute;s  tarde. Describimos a continuaci&oacute;n cuales son las divisiones mediante las que se  estructura la informaci&oacute;n del disco:</p>
      <p align="justify" class="Estilo1"><br />
        <strong>Cilindros y pistas</strong>: Los cilindros son  cada una de las circunferencias conc&eacute;ntricas en que est&aacute;n divididas las  superficies de todos los platos (es decir, un mismo cilindro comprende a todos  las caras de todos los platos). El n&uacute;mero de cilindros viene determinado por el  n&uacute;mero de posiciones distintas en que es capaz de detenerse la cabeza para  realizar una lectura o escritura. El n&uacute;mero de pistas es el resultado de  multiplicar cilindros por caras.</p>
      <p align="justify" class="Estilo1"><strong>Caras</strong>: son cada una de las  dos superficies que ofrecen los platos que forman el disco.<br />
          <strong>Sectores</strong>: son las zonas en que  se dividen las pistas. Usualmente cada sector permite almacenar 512 bytes de  informaci&oacute;n (aunque su capacidad real es algo mayor, pero esta reservada a  datos del propio disco</p>
      <p align="justify" class="Estilo1"><span class="Estilo8"><strong>Funcionamiento.</strong></span></p>
      <p align="justify" class="Estilo1"><br />
        Para describir el funcionamiento  de un disco duro y la influencia de cada una de las partes comentadas, vamos a  repasar un proceso completo de lectura o escritura. Esto permitir&aacute; conocer en  m&aacute;s detalle cual es el papel concreto de cada componente y como mediante la  estructuraci&oacute;n de la informaci&oacute;n podemos acceder directamente a cualquiera de  los sectores del disco (a diferencia de los dispositivos de acceso secuencial):<br />
      <img src="clip_image006.gif" width="256" height="219" hspace="200">      </p>
      <p class="Estilo1">&nbsp;</p>
      <p align="justify" class="Estilo1">El ordenador (por  mandato del Sistema Operativo) indica a la controladora del disco que realice  una determinada operaci&oacute;n de lectura o escritura. La controladora procesa la  informaci&oacute;n. Lo primero que debe hacer es enviar al actuador la corriente  exacta para desplazar las cabezas a la pista en la que vaya a realizarse la  lectura o escritura. Tras esto, esperar&aacute; hasta que el sector que se desea leer  o escribir, pase por debajo de la cabeza, gracias al giro a velocidad constante  de los platos del disco.<br />
    La cabeza lee el  sector detectando la polaridad de las part&iacute;culas magn&eacute;ticas de la superficie  del disco, o lo escribe realineando dichas part&iacute;culas. Una vez concluida la  lectura, los datos son enviados a la controladora y devueltos al ordenador. En  el caso de la escritura, la controladora devuelve  una confirmaci&oacute;n indicando que el proceso se realiz&oacute; correctamente.</p>
    <p align="justify" class="Estilo1">&nbsp;</p>
    <p align="justify" class="Estilo1">&nbsp;</p>
    <table width="677" bordercolor="#FFFFFF">
      <tr>
        <th width="461" scope="col"><div align="left"><span class="Estilo1"><a href="P&aacute;gina Principal.html">Volver  a la P&aacute;gina Principal</a></span> </div></th>
        <th width="101" scope="col"><span class="Estilo1"><a href="Disco Óptico.html">Anterior</a></span></th>
        <th width="91" scope="col"><span class="Estilo1"><a href="Teclado.html">Siguiente</a></span></th>
      </tr>
    </table>    <p align="justify" class="Estilo1">&nbsp;</p></th>
    <th width="162" scope="col">&nbsp;</th>
  </tr>
</table>
</body>
</html>
