<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Disco Óptico</title>
<style type="text/css">
<!--
.Estilo1 {
	font-size: 24px;
	font-family: "Times New Roman", Times, serif;
	color: #006666;
}
.Estilo2 {
	font-family: "Times New Roman", Times, serif;
	color: #006666;
}
.Estilo3 {
	font-family: "Times New Roman", Times, serif;
	font-size: 18px;
	color: #006666;
}
body {
	background-image: url(Fondo%20Negro.jpg);
}
.Estilo4 {
	color: #006666;
	font-size: 12px;
	font-family: "Times New Roman", Times, serif;
}
-->
</style>
</head>

<body>
<table width="1000" border="0" bordercolor="#333333">
  <tr>
    <th width="277" scope="col">&nbsp;</th>
    <th width="488" scope="col"><h1 align="center" class="Estilo1">&nbsp;</h1>
      <h1 align="center" class="Estilo1">7.- Disco &Oacute;ptico</h1>
      <p align="justify" class="Estilo2">&nbsp;</p>
      <p align="justify" class="Estilo3">Concepto.</p>
      <p align="justify" class="Estilo2">Un <strong>disco  &oacute;ptico</strong>n el campo de la inform&aacute;tica, la reproducci&oacute;n de sonido y el video, es una superficie circular de policarbonato donde la informaci&oacute;n se  guarda haciendo unos surcos en la superficie del disco. El acceso a los datos  se realiza cuando un material especial del disco, que suele ser de aluminio, es  iluminado con un haz de l&aacute;ser. Los surcos en la superficie modifican el comportamiento  del haz de l&aacute;ser reflejado y nos dan la informaci&oacute;n que contiene el disco.<br />
        La informaci&oacute;n en un disco &oacute;ptico es almacenada secuencialmente en una  espiral desde el c&iacute;rculo m&aacute;s interno hasta el m&aacute;s externo.</p>
      <h2 align="justify" class="Estilo3">Historia. </h2>
      <p align="justify" class="Estilo2">La aparici&oacute;n de los dispositivos de almacenamiento &oacute;ptico se desarroll&oacute; en  dos ramas paralelas. Por un lado, en EEUU, David Paul Gregg, con la compa&ntilde;&iacute;a MCA,  desarroll&oacute; un disco &oacute;ptico anal&oacute;gico para grabar v&iacute;deo y lo patent&oacute; en 1961 y  1969. Este fue el inicio de la era de los dispositivos &oacute;pticos. Por otro lado,  un grupo de f&iacute;sicos de Philips lanzaron el primer disco &oacute;ptico para grabar  video en Eindhoven (Holanda) en 1969. En 1975, Philips y MCA comenzaron a  trabajar juntos en el desarrollo de dispositivos &oacute;pticos para llegar a  introducir el laserdisc en 1978. MCA se encarg&oacute; del dispositivo y Philips de  los reproductores. Pero este desarrollo no tuvo &eacute;xito y la uni&oacute;n entre Philips  y MCA se disolvi&oacute;.</p>
      <p align="justify" class="Estilo2"><br />
        Posteriormente, fueron Philips y Sony los que se unieron en 1979 para  desarrollar un soporte para almacenamiento de audio con tecnolog&iacute;a digital. Sus  desarrollos llegaron hasta el lanzamiento en 1983 del CD. Paralelamente, la  compa&ntilde;&iacute;a Pioneer tuvo &eacute;xitos en el campo de los discos para video hasta el  desarrollo del actual DVD.<br />
        Los est&aacute;ndares de almacenamiento &oacute;ptico son regulados por la OSTA (Optical Storage  Technology Association).<br />
    Cronol&oacute;gicamente, podemos dividir la historia de los dispositivos &oacute;pticos de  almacenamiento en tres generaciones.</p>
    <p align="justify" class="Estilo2">&nbsp;</p>
    <table width="495" bordercolor="#FFFFFF">
      <tr>
        <th width="297" scope="col"><div align="left"><span class="Estilo4"><a href="Página Principal.html">Volver a la P&aacute;gina Principal </a></span></div></th>
        <th width="90" scope="col"><span class="Estilo4"><a href="Fuente de Alimentación.html">Anterior</a></span></th>
        <th width="84" scope="col"><span class="Estilo4"><a href="Disco Duro.html">Siguiente </a></span></th>
      </tr>
    </table>    <p align="justify" class="Estilo2">&nbsp;</p></th>
    <th width="213" scope="col">&nbsp;</th>
  </tr>
</table>
</body>
</html>
