<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Fuente de Alimentación</title>
<style type="text/css">
<!--
.Estilo1 {
	font-size: 12px;
	font-family: "Times New Roman", Times, serif;
	color: #006666;
}
.Estilo2 {
	color: #006666;
	font-weight: bold;
	font-size: 24px;
}
.Estilo4 {font-size: 18px; font-family: "Times New Roman", Times, serif; color: #006666; }
body {
	background-image: url(Fondo Negro.jpg);
	background-image: url(Fondo%20Negro.jpg);
}
-->
</style>
</head>

<body>
<table width="1024" border="0" bordercolor="#000000">
  <tr>
    <th width="190" scope="col">&nbsp;</th>
    <th width="650" scope="col"><h1 class="Estilo2">6.- Fuente de  Alimentaci&oacute;n</h1>
      <p align="justify"><img src="Fuente de Alimentaci&oacute;n.jpg" width="250" height="183" hspace="200" /></p>
      <p align="justify" class="Estilo1"><span class="Estilo4">Concepto.</span></p>
      <p align="justify" class="Estilo1"><br />
        En electr&oacute;nica, una <strong>fuente de alimentaci&oacute;n</strong> es un circuito que  convierte la tensi&oacute;n alterna de la red industrial en una tensi&oacute;n pr&aacute;cticamente  continua.</p>
      <h3 align="justify" class="Estilo4">Clasificaci&oacute;n.</h3>
      <h3 align="justify" class="Estilo1">Fuentes  de Alimentaci&oacute;n Continuas. </h3>
      <p align="justify" class="Estilo1">Usualmente la entrada es una tensi&oacute;n alterna proveniente de la red el&eacute;ctrica  comercial y la salida es una tensi&oacute;n continua con bajo nivel de rizado. Constan  de tres o cuatro etapas:</p>
      <div align="left" class="Estilo1">
        
        <div align="justify">
            <ul type="disc">
              <li>secci&oacute;n de entrada:       compuesta principalmente por un rectificador, tambi&eacute;n tiene elementos de       protecci&oacute;n como fusibles, varistores, etc. </li>
              <li>regulaci&oacute;n: su misi&oacute;n es       mantener la salida en los valores prefijados. </li>
              <li>salida: su misi&oacute;n es       filtrar, controlar, limitar, proteger y adaptar la fuente a la carga a la       que est&eacute; conectada.</li>
            </ul>
        </div>
      </div>
      <p align="justify" class="Estilo1">Este tipo de fuentes pueden ser tanto lineales como conmutadas.</p>
      <p align="justify" class="Estilo1"><br />
        <strong>Las fuentes lineales</strong> siguen el esquema: transformador, rectificador, filtro,  regulaci&oacute;n y salida. En primer lugar el transformador adapta los niveles de  tensi&oacute;n y proporciona aislamiento galv&aacute;nico. El circuito que convierte la  corriente alterna en continua se llama rectificador, despu&eacute;s suelen llevar un  circuito que disminuye el rizado como un filtro de condensador. La regulaci&oacute;n  se consigue con un componente disipativo regulable. La salida puede ser  simplemente un condensador.</p>
      <p align="justify" class="Estilo1"><br />
        <strong>Las fuentes conmutadas</strong> tienen por esquema: rectificador, conmutador,  transformador, otro rectificador y salida. La regulaci&oacute;n se obtiene con el  conmutador, normalmente un circuito PWM (<em>Pulse Width Modulation</em>) que  cambia el ciclo de trabajo. Aqu&iacute; las funciones del transformador son las mismas  que para fuentes lineales pero su posici&oacute;n es diferente. El segundo  rectificador convierte la se&ntilde;al alterna pulsante que llega del transformador en  un valor continuo. La salida puede ser tambi&eacute;n un filtro de condensador o uno  del tipo LC.<br />
        Las ventajas de las fuentes lineales son una mejor regulaci&oacute;n, velocidad y  mejores caracter&iacute;sticas EMC. Por otra parte las conmutadas obtienen un mejor  rendimiento, menor coste y tama&ntilde;o.</p>
      <h2 align="justify" class="Estilo4">Especificaciones. </h2>
      <p align="justify" class="Estilo1">Una especificaci&oacute;n fundamental de las fuentes de alimentaci&oacute;n es el  rendimiento, que se define como la potencia total de salida entre la potencia  activa de entrada. Como se ha dicho antes, las fuentes conmutadas son mejores  en este aspecto.</p>
      <p align="justify" class="Estilo1"><br />
        El factor de potencia es la potencia activa entre la potencia aparente de  entrada. Es una medida de la calidad de la corriente.</p>
      <p align="justify" class="Estilo1"><br />
        Aparte de disminuir lo m&aacute;s posible el rizado, la fuente debe mantener la  tensi&oacute;n de salida al voltaje solicitado independientemente de las oscilaciones  de la l&iacute;nea, regulaci&oacute;n de l&iacute;nea o de la carga requerida por el circuito, regulaci&oacute;n  de carga.</p>
      <p align="justify" class="Estilo1"><br />
        Entre las fuentes de alimentaci&oacute;n alternas, tenemos aquellas en donde la  potencia que se entrega a la carga est&aacute; siendo controlada por transistores, los  cuales son controlados en fase para poder entregar la potencia requerida a la  carga.</p>
      <p align="justify" class="Estilo1"><br />
        Otro tipo de alimentaci&oacute;n de fuentes alternas, catalogadas como especiales  son aquellas en donde la frecuencia es variada, manteniendo la amplitud de la  tensi&oacute;n logrando un efecto de fuente variable en casos como motores y  transformadores de tensi&oacute;n.</p>
      <p align="justify" class="Estilo1">&nbsp;</p>
      <table width="653" height="32" border="0" bordercolor="#FFFFFF">
        <tr>
          <th width="430" scope="col"><div align="left"><span class="Estilo1"><a href="Página Principal.html">Volver a la P&aacute;gina Principal</a></span> </div></th>
          <th width="94" scope="col"><span class="Estilo1"><a href="Tarjeta de Expansión.html">Anterior</a></span></th>
          <th width="115" scope="col"><span class="Estilo1"><a href="Disco Óptico.html">Siguiente</a></span></th>
        </tr>
      </table>      <p align="left" class="Estilo1">&nbsp;</p></th>
    <th width="170" scope="col">&nbsp;</th>
  </tr>
</table>
</body>
</html>
