<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Memoria RAM</title>
<style type="text/css">
<!--
.Estilo1 {
	font-size: 9px;
	font-family: "Times New Roman", Times, serif;
	color: #006666;
}
.Estilo4 {
	font-size: 24px;
	color: #006666;
	font-family: "Times New Roman", Times, serif;
}
.Estilo6 {font-family: "Times New Roman", Times, serif}
.Estilo7 {color: #006666}
.Estilo10 {color: #006666; font-family: "Times New Roman", Times, serif; font-size: 18px; }
.Estilo12 {font-family: "Times New Roman", Times, serif; font-size: 12px; }
.Estilo13 {color: #006666; font-size: 12px; }
.Estilo14 {color: #006666; font-family: "Times New Roman", Times, serif; font-size: 12px; }
body {
	background-image: url(Fondo%20Negro.jpg);
}
.Estilo15 {color: #006666; font-size: 9px; }
-->
</style>
</head>

<body>
<table width="933" bordercolor="#000000">
  <tr>
    <th width="140" scope="col">&nbsp;</th>
    <th width="697" scope="col"><p><span class="Estilo4">4.- Memoria RAM</span> </p>
<p class="Estilo6"><br />
  <img src="clip_image001.jpg" width="290" height="218"></p>
      <p align="justify" class="Estilo10">Concepto.</p>
      <p align="justify" class="Estilo14">La <strong>memoria de acceso aleatorio</strong> (en ingl&eacute;s: <em>Random Access Memory</em> cuyo acr&oacute;nimo es <strong>RAM</strong>) es la memoria desde donde el procesador recibe las  instrucciones y guarda los resultados. Es el &aacute;rea de trabajo para la mayor  parte del software de un computador.[]  Existe una memoria intermedia entre el procesador y la RAM, llamada cach&eacute;, pero &eacute;sta  s&oacute;lo es una copia de acceso r&aacute;pido de la memoria principal almacenada en los  m&oacute;dulos de RAM.[] Los m&oacute;dulos de RAM son la  presentaci&oacute;n comercial de este tipo de memoria, se compone de integrados  soldados sobre un circuito impreso.<br />
  Se trata de una memoria de estado s&oacute;lido tipo DRAM en la que se puede tanto  leer como escribir informaci&oacute;n. Se utiliza como memoria de trabajo para el  sistema operativo, los programas y la mayor&iacute;a del software. Es all&iacute; donde se  cargan todas las instrucciones que ejecutan el procesador y otras unidades de  c&oacute;mputo. Se dicen &quot;de acceso aleatorio&quot; o &quot;de acceso  directo&quot; porque se puede leer o escribir en una posici&oacute;n de memoria con un  tiempo de espera igual para cualquier posici&oacute;n, no siendo necesario seguir un  orden para acceder a la informaci&oacute;n de la manera m&aacute;s r&aacute;pida posible.</p>
      <p align="justify" class="Estilo14">Integrado de silicio de 64 Bites sobre un sector de memoria  de n&uacute;cleo (finales de los 60)<br />
        La frase <strong>memoria RAM</strong> se utiliza frecuentemente para referirse a los <strong>m&oacute;dulos  de memoria</strong> que se usan en los computadores personales y servidores. En el  sentido estricto, estos dispositivos contienen un tipo entre varios de memoria  de acceso aleatorio, ya que las ROM, memorias Flash , cach&eacute; (SRAM) , los registros  en procesadores y otras unidades de procesamiento tambi&eacute;n poseen la cualidad de  presentar retardos de acceso iguales para cualquier posici&oacute;n.</p>
      <p align="justify" class="Estilo10">Historia </p>
      <p align="justify" class="Estilo13">La denominaci&oacute;n &ldquo;de Acceso aleatorio&rdquo; surgi&oacute; para diferenciarlas de las memoria  de acceso secuencial, debido a que en los comienzos de la computaci&oacute;n, las  memorias principales (o primarias) de las computadoras eran siempre de tipo RAM  y las memorias secundarias (o masivas) eran de acceso secuencial (cintas o  tarjetas perforadas). Es frecuente pues que se hable de memoria RAM para hacer  referencia a la memoria principal de una computadora, pero actualmente la  denominaci&oacute;n no es precisa.<br />
  Uno de los primeros tipos de memoria RAM fue la memoria de n&uacute;cleo magn&eacute;tico,  desarrollada entre 1949 y 1952 y usada en muchos computadores hasta el  desarrollo de circuitos integrados a finales de los a&ntilde;os 60 y principios de los  70. Antes que eso, las computadoras usaban reles y l&iacute;neas de retardo de varios  tipos construidas con tubos de vac&iacute;o para implementar las funciones de memoria  principal con o sin acceso aleatorio.</p>
      <p align="justify" class="Estilo13"><br />
        En 1969 fueron lanzadas una de las primeras memorias RAM basadas en  semiconductores de silicio por parte de Intel con el integrado 3101 de 64 bits  de memoria y para el siguiente a&ntilde;o se presento una memoria DRAM de 1 Kilobyte,  referencia 1103 que se constituyo en un hito, ya que fue la primera en ser  comercializada con &eacute;xito, lo que significo el principio del fin para las  memorias de n&uacute;cleo magn&eacute;tico. En comparaci&oacute;n con los integrados de memoria DRAM  actuales, la 1103 es primitiva en varios aspectos, pero tenia un desempe&ntilde;o  mayor que la memoria de n&uacute;cleos.</p>
      <p align="justify" class="Estilo13"><br />
        En 1973 se present&oacute; una innovaci&oacute;n que permiti&oacute; otra miniaturizaci&oacute;n y se  convirti&oacute; en est&aacute;ndar para las memorias DRAM: la multiplexaci&oacute;n en tiempo de la  direcciones de memoria. MOSTEK lanz&oacute; la referencia MK4096 de 4Kb en un empaque  de 16 pines,[] mientras sus competidores las  fabricaban en el empaque DIP de 22 pines. El esquema de direccionamiento[]  se convirti&oacute; en un est&aacute;ndar de facto debido a la gran popularidad que logr&oacute;  esta referencia de DRAM. Para finales de los 70 los integrados eran usados en  la mayor&iacute;a de computadores nuevos, se soldaban directamente a las placas base o  se instalaban en z&oacute;calos, de manera que ocupaban un &aacute;rea extensa de circuito  impreso. Con el tiempo se hizo obvio que la instalaci&oacute;n de RAM sobre el impreso  principal, imped&iacute;a la miniaturizaci&oacute;n, entonces se idearon los primeros m&oacute;dulos  de memoria como el SIPP, aprovechando las ventajas de la construcci&oacute;n modular.  El formato SIMM fue una mejora al anterior, eliminando los pines met&aacute;licos y  dejando unas &aacute;reas de cobre en uno de los bordes del impreso, muy similares a  los de las tarjetas de expansi&oacute;n, de hecho los m&oacute;dulos SIPP y los primeros SIMM  tienen la misma distribuci&oacute;n de pines.</p>
      <p align="left" class="Estilo13"><img src="clip_image002.jpg" width="290" height="153" hspace="200"></p>
      <table width="417" border="0" bordercolor="#000000">
        <tr>
          <th width="407" scope="col"><p align="left" class="Estilo15">4MB de memoria RAM para un computador VAX de finales de los  70.Los integrados de memoria DRAM estan agrupados arriba a derecha e izquierda</p>          </th>
        </tr>
      </table>
      <p align="left" class="Estilo13">&nbsp;</p>
      <p align="left" class="Estilo13"><img src="clip_image003.jpg" width="290" height="158" hspace="230"></p>
      <p align="center" class="Estilo15">M&oacute;dulo de memoria tipo SIPP instalados directamente sobre la  placa base</p>
      <p align="justify" class="Estilo13"><br />
        A finales de los 80 el aumento en la velocidad de los procesadores y el  aumento en el ancho de banda requerido, dejaron rezagadas a las memorias DRAM  con el esquema original MOSTEK, de manera que se realizaron una serie de  mejoras en el direccionamiento como las siguientes:</p>
      <div align="left" class="Estilo14">
          <div align="justify">
            <ul type="disc">
              <li class="Estilo7"><strong>FPM-RAM (Fast Page Mode RAM)</strong> </li>
            </ul>
          </div>
      </div>
      <p align="justify" class="Estilo13">Inspirado en t&eacute;cnicas como el &quot;Burst Mode&quot; usado en procesadores  como el Intel 486,[ &nbsp;se implanto un modo direccionamiento en el que  el controlador de memoria env&iacute;a una sola direcci&oacute;n y recibe a cambio esa y  varias consecutivas sin necesidad de generar todas las direcciones. Esto supone  un ahorro de tiempos ya que ciertas operaciones son repetitivas cuando se desea  acceder a muchas posiciones consecutivas. Funciona como si dese&aacute;ramos visitar  todas las casas en una calle: despu&eacute;s de la primera vez no seria necesario  decir el n&uacute;mero de la calle, &uacute;nicamente seguir la misma. Se fabricaban con  tiempos de acceso de 70 &oacute; 60 ns y fueron muy populares en sistemas basados en  el 486 y los primeros Pentium.</p>
      <div align="left" class="Estilo14">
          <div align="justify">
            <ul type="disc">
              <li class="Estilo7"><strong>EDO-RAM (Extended Data Output RAM)</strong></li>
            </ul>
          </div>
      </div>
      <p align="justify" class="Estilo13">Lanzada en 1995 y con tiempos de accesos de 40 o 30ns suponia una mejora  sobre su antecesora la FPM. La  EDO, tambi&eacute;n es capaz de enviar direcciones contiguas pero direcciona la  columna que va utilizar mientras que se lee la informaci&oacute;n de la columna  anterior, dando como resultado una eliminaci&oacute;n de estados de espera,  manteniendo activo el buffer de salida hasta que comienza el pr&oacute;ximo ciclo de  lectura.</p>
      <div align="left" class="Estilo14">
          <div align="justify">
            <ul type="disc">
              <li class="Estilo7"><strong>BEDO-RAM (Burst Extended Data Output RAM</strong></li>
            </ul>
          </div>
      </div>
      <p align="justify" class="Estilo13">Fue la evoluci&oacute;n de la EDO   RAM y competidora de la SDRAM, fue presentada en 1997. Era un tipo de  memoria que usaba generadores internos de direcciones y acced&iacute;a a mas de una  posici&oacute;n de memoria en cada ciclo de reloj, de manera que lograba un desempe&ntilde;o  un 50% mejor que la EDO.   Nunca salio al mercado, dado que Intel y otros fabricantes se  decidieron por esquemas de memoria sincr&oacute;nicos que si bien ten&iacute;an mucho del  direccionamiento MOSTEK, agregan funcionalidades distintas como se&ntilde;ales de  reloj.</p>
      <h2 align="justify" class="Estilo10">M&oacute;dulos de memoria RAM </h2>
      <p align="justify" class="Estilo13">Los m&oacute;dulos de memoria RAM son tarjetas de circuito impreso que tienen  soldados integrados de memoria DRAM por una o ambas caras. La implementaci&oacute;n DRAM  se basa en una topolog&iacute;a de circuito electr&oacute;nico que permite alcanzar  densidades altas de memoria por cantidad de transistores, logrando integrados  de cientos o miles de Kilobits. &nbsp;&nbsp;Adem&aacute;s  de DRAM, los m&oacute;dulos poseen un integrado que permiten la identificaci&oacute;n del  mismo ante el computador por medio del protocolo de comunicaci&oacute;n SPD. La  conexi&oacute;n con los dem&aacute;s componentes se realiza por medio de un &aacute;rea de pines en uno  de los filos del circuito impreso, que permiten que el modulo al ser instalado  en un z&oacute;calo apropiado de la placa base, tenga buena conexi&oacute;n el&eacute;ctrica con los  controladores de memoria y las fuentes de alimentaci&oacute;n. Los primeros m&oacute;dulos  comerciales de memoria eran SIPP de formato propietario, es decir no hab&iacute;a un  est&aacute;ndar entre distintas marcas. La necesidad de hacer intercambiable los  m&oacute;dulos y de utilizar integrados de distintos fabricantes condujo al  establecimiento de est&aacute;ndares de la industria como los JEDEC.</p>
      <div align="left" class="Estilo12">
              <div align="justify">
                <ul type="disc">
                  <li class="Estilo7">M&oacute;dulos DIMM Usado en       computadores de escritorio. Se caracterizan por tener un bus de datos de       64 bits. </li>
                  <li class="Estilo7">M&oacute;dulos SO-DIMM Usado en       computadores port&aacute;tiles. Formato miniaturizado de DIMM. </li>
                  <li class="Estilo7">M&oacute;dulos SIMM Un formato       usado en computadores antiguos. ten&iacute;an un bus de datos de 16 o 32 bits</li>
                </ul>
        </div>
      </div>
      <p class="Estilo12"><img src="clip_image004.jpg" width="200" height="185"></p>
      <p class="Estilo1">Formato SO-DIMM</p>
      <p class="Estilo1">&nbsp;</p>
      <p class="Estilo1">&nbsp;</p>
      <table width="728" bordercolor="#FFFFFF">
        <tr>
          <th width="529" scope="col"><div align="left"><span class="Estilo14"><a href="P&aacute;gina Principal.html">Volver a la P&aacute;gina Principal </a></span></div></th>
          <th width="77" scope="col"><span class="Estilo14"><a href="CPU.html">Anterior</a></span></th>
          <th width="98" scope="col"><span class="Estilo14"><a href="Tarjeta de Expansi&oacute;n.html">Siguiente</a></span></th>
        </tr>
      </table>      <p class="Estilo6">&nbsp;</p></th>
    <th width="74" scope="col">&nbsp;</th>
  </tr>
</table>
</body>
</html>
