<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Monitor</title>
<style type="text/css">
<!--
.Estilo2 {font-family: fantasy}
.Estilo4 {font-size: 24}
.Estilo5 {
	font-family: fantasy;
	font-size: 16px;
	color: #006666;
}
.Estilo6 {font-size: 12px}
.Estilo7 {font-size: 12}
.Estilo8 {font-size: 14px}
.Estilo9 {font-size: 16px}
.Estilo10 {font-size: 18px}
.Estilo14 {font-size: 16px; color: #006666; }
.Estilo15 {font-family: "Times New Roman", Times, serif; font-size: 12px; color: #006666; }
body {
	background-image: url(Fondo%20Negro.jpg);
}
.Estilo17 {font-family: "Times New Roman", Times, serif}
.Estilo18 {font-size: 12px; font-family: "Times New Roman", Times, serif; }
.Estilo19 {color: #006666}
.Estilo21 {
	font-family: "Times New Roman", Times, serif;
	font-size: 24px;
	color: #006666;
}
.Estilo22 {
	font-family: "Times New Roman", Times, serif;
	font-size: 18px;
	font-weight: bold;
}
.Estilo23 {font-size: 18px; color: #006666; }
.Estilo26 {font-size: 12px; color: #006666; }
-->
</style>
</head>

<body>
<table width="915" height="360" border="0" bordercolor="#000000">
  <tr>
    <th width="956" height="100" scope="col"><p class="Estilo21">1.- Monitor</p>
      <p><img src="Imagen Monitor.jpg" width="246" height="190" hspace="50" vspace="20"></p>    </th>
  </tr>
</table>
<table width="943" border="0" bordercolor="#000000">
  <tr>
    <th width="153" scope="col">&nbsp;</th>
    <th width="635" scope="col"><p align="justify" class="Estilo2"><span class="Estilo4"><span class="Estilo6"><span class="Estilo7"><span class="Estilo8"><span class="Estilo9"><span class="Estilo10"><span class="Estilo14"><span class="Estilo6"><span class="Estilo22">Concepto. </span></span></span></span></span></span></span></span></span></p>
      <p align="justify" class="Estilo17"><span class="Estilo4"><span class="Estilo6"><span class="Estilo7"><span class="Estilo8"><span class="Estilo9"><span class="Estilo10"><span class="Estilo14"><span class="Estilo6">El monitor o pantalla  de computadora no es m&aacute;s que &nbsp;un dispositivo  de salida que mediante una interfaz muestra los resultados del procesamiento de  una computadora.</span></span></span></span></span></span></span></span></p>
      <p align="justify" class="Estilo15"><br>
          <span class="Estilo10"><strong>Tipos.</strong></span></p>
      <p align="justify" class="Estilo26">En la actualidad, los monitores est&aacute;n  disponibles en una variedad de formas, dise&ntilde;os y colores. &nbsp;&nbsp;&nbsp;Sin  embargo, sobre la base de la tecnolog&iacute;a utilizada en la fabricaci&oacute;n de los  monitores, pueden ser ampliamente clasificados en dos tipos: CRT (tubo de rayos  cat&oacute;dicos) y la pantalla LCD (pantalla de cristel l&iacute;quido).</p>
      <p align="justify" class="Estilo26"><br>
          <strong>CRT (tubo de rayos cat&oacute;dicos).&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;</strong>&nbsp;Los monitores CRT emplean la tecnolog&iacute;a  utilizada m&aacute;s com&uacute;nmente en la fabricaci&oacute;n de pantallas de televisi&oacute;n. &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;En este sentido, un flujo intenso de  electrones de alta energ&iacute;a se utiliza para formar las im&aacute;genes en una pantalla  fluorescente. Un tubo de rayos cat&oacute;dicos es b&aacute;sicamente un tubo de vac&iacute;o que  contiene un ca&ntilde;&oacute;n de electrones en un extremo y una pantalla fluorescente en el  otro extremo. A partir de este ca&ntilde;&oacute;n de electrones, un fuerte haz de electrones  es generado por un proceso llamado termi&oacute;nica emisi&oacute;n. Estos electrones se  hacen viajar a trav&eacute;s de un estrecho sendero en el tubo con alta velocidad  utilizando diversos dispositivos electromagn&eacute;ticos y, por &uacute;ltimo, la huelga de  los puntos de f&oacute;sforo presente en la pantalla fluorescente, creando as&iacute; una  imagen. Hay varias ventajas de la utilizaci&oacute;n de monitores CRT. </p>
      
      
      <div align="justify" class="Estilo26">
          <ul type="disc" class="Estilo17">
            <li class="Estilo6"> Estos monitores son muy       fiable, eficiente y capaz de generar una resoluci&oacute;n de hasta 2048 x 1536       p&iacute;xeles, proporcionando as&iacute; una calidad de imagen. Adem&aacute;s, los monitores       CRT que ya est&aacute;n disponibles son capaces de producir miles de colores       diferentes. </li>
            <li class="Estilo6">
            En segundo lugar, los       monitores CRT son asequibles y rentables. </li>
            <li class="Estilo6"> A diferencia de los       monitores CRT convencionales, modernos avances tecnol&oacute;gicos han       posibilitado el desarrollo de los monitores CRT de pantalla plana que       reducen el deslumbramiento y son buenas para los ojo.</li>
          </ul>
      </div>
      <p align="justify" class="Estilo26">Sin embargo, la &uacute;nica preocupaci&oacute;n con la compra de los monitores CRT es que  son pesados y pueden ocupar una gran cantidad de espacio de trabajo. Adem&aacute;s,  estos dispositivos se calientan hasta obtener muy f&aacute;cilmente. </p>
      <p align="justify" class="Estilo26"><br>
          <span onMouseOver="_tipon(this)" onMouseOut="_tipoff()"><strong>LCD (cristal  l&iacute;quido) Monitores:</strong> la pantalla de cristal l&iacute;quido, tambi&eacute;n conocido como  diodo de cristal l&iacute;quido, es una de las m&aacute;s avanzadas tecnolog&iacute;as disponibles  en la actualidad.</span> Normalmente, un monitor LCD se compone de una capa de  color o monocromo p&iacute;xeles organizados esquem&aacute;ticamente entre un par de  electrodos transparentes y dos filtros polarizadores. Efecto &oacute;ptico se consigue  mediante la polarizaci&oacute;n de la luz en diversas cantidades y hacerlo pasar a  trav&eacute;s de la capa de cristal l&iacute;quido. En la actualidad, existen dos tipos  diferentes de tecnolog&iacute;a LCD disponibles. Estos incluyen la matriz activa o  TFT, y una tecnolog&iacute;a de matriz pasiva. Entre &eacute;stas, la tecnolog&iacute;a TFT es mucho  m&aacute;s segura, fiable y genera una mejor calidad de imagen. Por otra parte, de  matriz pasiva tiene un tiempo de respuesta lento y poco a poco convirti&eacute;ndose  en obsoleta. <br>
        En los &uacute;ltimos tiempos, los monitores LCD se est&aacute;n convirtiendo cada vez m&aacute;s  populares entre los consumidores. Algunas de las principales ventajas de usar  un monitor LCD son: </p>
      <div align="justify" class="Estilo15">
          
        <div align="justify">
              <ul type="disc">
                <li class="Estilo6">Estos monitores son       compactos, ligeros de peso y no consumen mucho espacio en el escritorio. </li>
                <li class="Estilo6">En segundo lugar, estos       monitores no consumen mucha electricidad y puede ser operado mediante el       uso de pilas. </li>
                <li class="Estilo6">Adem&aacute;s, las im&aacute;genes       transmitidas por estos monitores no se han distorsionado y geom&eacute;tricamente       poco parpadeo.</li>
              </ul>
        </div>
      </div>
      <p align="justify" class="Estilo26">Sin embargo, los monitores LCD tienen algunas desventajas. Lo que es m&aacute;s  importante, estos monitores son muy caros. En segundo lugar, la calidad de la  imagen no es constante cuando se ve desde diferentes &aacute;ngulos. Asimismo, la  resoluci&oacute;n de un monitor LCD es siempre constante. Cualquier modificaci&oacute;n puede  resultar en un menor rendimiento. </p>
      <h2 align="justify" class="Estilo26">Par&aacute;metros de la Pantalla</h2>
      
      <div align="justify" class="Estilo18">
            
        <div align="justify" class="Estilo26">
                  <ul type="disc">
                    <li class="Estilo6"><strong>P&iacute;xel</strong>: Unidad m&iacute;nima       representable en un monitor. </li>
                  </ul>
                  <ul type="disc">
                    <li class="Estilo6"><strong>Tama&ntilde;o de punto</strong> o (<em>dot       pitch</em>): El tama&ntilde;o de punto es el espacio entre dos f&oacute;sforos coloreados       de un pixel. Es un par&aacute;metro que mide la nitidez de la imagen, midiendo la       distancia entre dos puntos del mismo color; resulta fundamental a grandes       resoluciones. Los tama&ntilde;os de punto m&aacute;s peque&ntilde;os producen im&aacute;genes m&aacute;s       uniformes. Un monitor de 14 pulgadas suele tener un tama&ntilde;o de punto       de 0,28 mm       o menos. En ocasiones es diferente en vertical que en horizontal, o se       trata de un valor medio, dependiendo de la disposici&oacute;n particular de los       puntos de color en la pantalla, as&iacute; como del tipo de rejilla empleada para       dirigir los haces de electrones. En LCD y en CRT de apertura de rejilla,       es la distancia en horizontal, mientras que en los CRT de m&aacute;scara de       sombra, se mide casi en diagonal. Lo m&iacute;nimo exigible en este momento es       que sea de 0,28mm. Para CAD o en general para dise&ntilde;o, lo ideal ser&iacute;a de       0,25mm o menos. 0,21 en m&aacute;scara de sombra es el equivalente a 0.24 en       apertura de rejilla. </li>
                  </ul>
                  <ul type="disc">
                    <li class="Estilo6"><strong>&Aacute;rea &uacute;til</strong>: El tama&ntilde;o       de la pantalla no coincide con el &aacute;rea real que se utiliza para       representar los datos. </li>
                  </ul>
                  <ul type="disc">
                    <li class="Estilo6"><strong>Resoluci&oacute;n m&aacute;xima</strong>:       es la resoluci&oacute;n m&aacute;xima o nativa (y &uacute;nica en el caso de los LCD) que es       capaz de representar el monitor; est&aacute; relacionada con el tama&ntilde;o de la pantalla       y el tama&ntilde;o del punto. </li>
                  </ul>
                  <ul type="disc">
                    <li class="Estilo6"><strong>Tama&ntilde;o de la pantalla</strong>:       Es la distancia en diagonal de un v&eacute;rtice de la pantalla al opuesto, que       puede ser distinto del &aacute;rea visible. </li>
                  </ul>
                  <ul type="disc">
                    <li class="Estilo6"><strong>Ancho de banda</strong>:       Frecuencia m&aacute;xima que es capaz de soportar el monitor.</li>
                  </ul>
                  <ul type="disc">
                    <li class="Estilo6"><strong>Hz o frecuencia de       refresco vertical</strong>: son 2 valores entre los cuales el monitor es capaz       de mostrar im&aacute;genes estables en la pantalla. </li>
                  </ul>
                  <ul type="disc">
                    <li class="Estilo6"><strong>Hz o frecuencia de       refresco horizontal</strong> : similar al anterior pero en sentido horizontal,       para dibujar cada una de las l&iacute;neas de la pantalla. </li>
                  </ul>
                <ul type="disc">
                  <li class="Estilo6"><strong>Blindaje</strong>: Un monitor       puede o no estar blindando ante interferencias el&eacute;ctricas externas y ser       m&aacute;s o menos sensible a ellas, por lo que en caso de estar blindando, o       semiblindado por la parte trasera llevara cubriendo pr&aacute;cticamente la       totalidad del tubo una plancha metalica en contanto con tierra o masa.</li>
                </ul>
        </div>
          <p align="justify" class="Estilo23">Ventajas y Desventajas </p>
            
          <div align="justify" class="Estilo6">
                  <ul type="disc" class="Estilo19">
                    <li><strong>Ventajas de las       pantallas LCD:</strong></li>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <ul type="circle">
                      <li>El grosor es inferior        por lo que pueden utilizarse en port&aacute;tiles. </li>
                      <li>Cada punto se encarga        de dejar o no pasar la luz, por lo que no hay moire. </li>
                      <li>La geometr&iacute;a es        siempre perfecta, lo determina el tama&ntilde;o del p&iacute;xel </li>
                    </ul>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <li><strong>Desventajas de las       pantallas LCD:</strong></li>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <ul type="circle">
                      <li>S&oacute;lo pueden        reproducir fielmente la resoluci&oacute;n nativa, con el resto, se ve un borde        negro, o se ve difuminado por no poder repruducir medios p&iacute;xeles. </li>
                      <li>Por s&iacute; solas no        producen luz, necesitan una fuente externa. </li>
                      <li>Si no se mira dentro        del cono de visibilidad adecuado, desvirt&uacute;an los colores. </li>
                      <li>El ADC y el DAC de un        monitor LCD para reproducir colores limita la cantidad de colores        representable. </li>
                      <ul type="square">
                        <li>El ADC (Convertidor         Digital a Anal&oacute;gico) en la entrada de video anal&oacute;gica (cantidad de         colores a representar). </li>
                        <li>El DAC (Convertidor         Anal&oacute;gico a Digital) dentro de cada p&iacute;xel (cantidad de posibles colores         representables). </li>
                        <li>en los CRT es la         tarjeta gr&aacute;fica la encargada de realizar esto, el monitor no influye en         la cantidad de colores representables, salvo en los primeros modelos de         monitores que ten&iacute;an entradas digitales TTL en lugar de entradas         anal&oacute;gicas. </li>
                      </ul>
                    </ul>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <li><strong>Ventajas de las       pantallas CRT:</strong></li>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <ul type="circle">
                      <li>Permiten reproducir        una mayor variedad crom&aacute;tica. </li>
                      <li>Distintas        resoluciones se pueden ajustar al monitor. </li>
                      <li>En los monitores de        apertura de rejilla no hay moire vertical. </li>
                    </ul>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <li><strong>Desventajas de las       pantallas CRT:</strong></li>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <ul type="circle">
                      <li>Ocupan m&aacute;s espacio        (cuanto m&aacute;s fondo, mejor geometr&iacute;a). </li>
                      <li>Los modelos antiguos        tienen la pantalla curva. </li>
                      <li>Los campos el&eacute;ctricos        afectan al monitor (la imagen vibra). </li>
                      <li>Para disfrutar de una        buena imagen necesitan ajustes por parte del usuario. </li>
                      <li>En los monitores de        apertura de rejilla se pueden apreciar varias l&iacute;neas de tensi&oacute;n muy finas        y dif&iacute;ciles de apreciar que cruzan la pantalla horizontalmente, se pueden        apreciar con fondo blanco. </li>
                    </ul>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <li><strong>Datos t&eacute;cnicos,       comparativos entre s&iacute;:</strong></li>
                  </ul>
                  <ul type="disc" class="Estilo19">
                    <ul type="circle">
                      <li>En los CRT, la frecuencia        de refresco es la que tiene la tarjeta grafica, en los LCD no siempre es        la que se le manda </li>
                      <li>Los CRT pueden tener        modo progresivo y entrelazado, los LCD tiene otro m&eacute;todo de        representaci&oacute;n. </li>
                      <li>En los CRT se pierde        aproximadamente 1         pulgada del tama&ntilde;o, que se utiliza para la        sujeccion del tubo, en los CRT es pr&aacute;cticamente lo que ocupa el LCD. </li>
                      <li>El peso de un LCD se        ve incrementado por la peana para darle estabilidad, pero el monitor en        s&iacute; no pesa pr&aacute;cticamente nada. </li>
                      <li>Los LCD suelen        necesitar de un transformador externo al monitor, en los CRT toda la        electr&oacute;nica va dentro del monitor. </li>
                      <li>En los LCD el consumo        es menor, y la tensi&oacute;n de utilizaci&oacute;n por parte de la electr&oacute;nica        tambi&eacute;n. </li>
                      <li>En los CRT pueden        aparecer problemas de &quot;quemar&quot; el fosforo de la pantalla, esto        ocurre al dejar una imagen fija durante mucho tiempo, como la palabra        &quot;insert coin&quot; en las recreativas, en los LCD los problemas        pueden ser de p&iacute;xeles defectuosos (siempre encendido o, siempre apagado),        aparte de otros da&ntilde;os. </li>
                      <li>El parpadeo de ambos        tipos de pantallas es debido a la baja frecuencia de refresco, unido a la        persistencia del brillo del fosforo, y a la memoria de cada p&iacute;xel en un        CRT y LCD respectivamente, que mitigan este defecto.</li>
                      <ul type="square">
                        <li>Con baja velocidad         de refresco y un tiempo grande de persistencia del f&oacute;sforo, no hay         parpadeo, pero si la persistencia del fosforo es baja y el refresco es         bajo, se produce este problema. Sin emabargo esto puede causar un efecto         de desvanecimiento o visi&oacute;n borrosa, al permanecer a&uacute;n encendido un         punto, en el siguiente refresco de la pantalla. </li>
                      </ul>
                    </ul>
                  </ul>
        </div>
      </div>
      <p align="justify" class="Estilo15"><span class="Estilo10"><strong>Limpieza de los Monitores</strong>.</span></p>
      <p align="justify" class="Estilo15">&nbsp;Los monitores  CRT se pueden limpiar con cualquier limpiacristales, pero los LCD son m&aacute;s  sensibles, ya que son porosos y pueden atrapar la suciedad y los l&iacute;quidos que  le apliquemos, en los manuales de instrucciones de los LCD pueden existir notas  al respecto. M&eacute;todos para limpiar monitores de LCD:</p>
      <div align="justify" class="Estilo18">
          
        <div align="justify">
              <ul type="disc" class="Estilo19">
                <li>Agua destilada y un pa&ntilde;o       que no suelte pelusas como los de limpiar las gafas, ligeramente       humedecido. </li>
                <li>Productos espec&iacute;ficos para       limpiar pantallas de LCD, </li>
                <li>Limpiador antiest&aacute;tico. </li>
                <li>Por Internet dicen tambi&eacute;n       que las toallitas de limpiar el trasero de los ni&ntilde;os peque&ntilde;os sirven, pero       no se recomienda, por no ser un producto dise&ntilde;ado para limpiar una       pantalla (ver negrita). </li>
              </ul>
        </div>
      </div>
      <p align="justify" class="Estilo15">Hay que tener en cuenta que existen 2 tipos de pantallas: mates y  brillantes; en cualquier caso mire en el manual de instrucciones de la pantalla  c&oacute;mo limpiarlo, o en su defecto al fabricante, ya que la limpieza de un monitor  con productos no destinados a tal fin pueden dejar manchas en la pantalla de  forma permanente.</p>
      <p align="justify" class="Estilo15">&nbsp;</p>
      <table width="616" height="41" border="0" bordercolor="#FFFFFF">
        <tr>
          <th width="356" scope="col">&nbsp;</th>
          <th width="110" scope="col"><span class="Estilo15"><a href="Página Principal.html">Anterior</a></span></th>
          <th width="126" scope="col"><span class="Estilo26"><a href="Tarjeta Madre.html">Siguiente</a></span></th>
        </tr>
      </table>
    </th>
    <th width="133" scope="col">&nbsp;</th>
  </tr>
</table>
<p>&nbsp;</p>
<p align="left" class="Estilo2"><span class="Estilo4"><span class="Estilo6"><span class="Estilo7"><span class="Estilo8"><span class="Estilo9"><span class="Estilo10"><span class="Estilo14"><br>
</span></span></span></span></span></span></span></p>
</body>
</html>
