<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Mouse</title>
<style type="text/css">
<!--
.Estilo1 {
	font-family: "Times New Roman", Times, serif;
	font-size: 12px;
	color: #006666;
}
.Estilo2 {font-family: "Times New Roman", Times, serif; font-size: 24px; color: #006666; }
.Estilo3 {font-size: 18px}
.Estilo4 {font-family: "Times New Roman", Times, serif; font-size: 18px; color: #006666; }
.Estilo5 {font-family: "Times New Roman", Times, serif; font-size: 9px; color: #006666; }
body {
	background-image: url(Fondo Negro.jpg);
	background-image: url(Fondo%20Negro.jpg);
}
-->
</style>
</head>

<body>
<table width="959" border="0" bordercolor="#000000">
  <tr>
    <th width="51" scope="col">&nbsp;</th>
    <th width="853" scope="col"><h1 align="center" class="Estilo2">10.- Mouse</h1>
      <p align="justify" class="Estilo1"><img src="Mouse 2.JPG" width="253" height="191" hspace="300" /></p>
      <p align="justify" class="Estilo1"><span class="Estilo3">Concepto.</span></p>
      <p align="justify" class="Estilo1"><br />
        El <strong><em>rat&oacute;n</em></strong> o <strong>mouse</strong> (del ingl&eacute;s, pronunciado [ma&#650;s]) es un dispositivo apuntador, generalmente  fabricado en pl&aacute;stico. Se utiliza con una de las manos del usuario y detecta su  movimiento relativo en dos dimensiones por la superficie plana en la que se  apoya, reflej&aacute;ndose habitualmente a trav&eacute;s de un puntero o flecha en el monitor.<br />
        Hoy en d&iacute;a es un elemento imprescindible en un equipo inform&aacute;tico para la  mayor&iacute;a de las personas, y pese a la aparici&oacute;n de otras tecnolog&iacute;as con una  funci&oacute;n similar, como la pantalla t&aacute;ctil, la pr&aacute;ctica ha demostrado que tendr&aacute;  todav&iacute;a muchos a&ntilde;os de vida &uacute;til. No obstante, en el futuro podr&iacute;a ser posible  mover el cursor o el puntero con los ojos o basarse en el reconocimiento de voz.</p>
      <h2 align="justify" class="Estilo4">El Nombre.</h2>
      <p align="justify" class="Estilo4"><img src="clip_image001_0003.jpg" width="180" height="135" hspace="330" /></p>
      <p align="center" class="Estilo5">La forma del dispositivo origin&oacute; su nombre</p>
      <p align="justify" class="Estilo1"><br />
        Aunque cuando se patent&oacute; recibi&oacute; el nombre de &quot;X-Y Position Indicator  for a Display System&quot; (<em>Indicador de posici&oacute;n X-Y para un sistema con  pantalla</em>), el m&aacute;s usado nombre de rat&oacute;n (<em>mouse</em> en ingl&eacute;s) se lo dio  el equipo de la Universidad  de Stanford durante su desarrollo, ya que su forma y su <em>cola</em> (cable)  recuerdan a un roedor.<br />
        En Am&eacute;rica predomina el t&eacute;rmino ingl&eacute;s <em>mouse</em> mientras que en Espa&ntilde;a  se utiliza pr&aacute;cticamente de manera exclusiva el calco sem&aacute;ntico &laquo;rat&oacute;n&raquo;. El <em>Diccionario  panhisp&aacute;nico de dudas</em> recoge ambos t&eacute;rminos, aunque considera que, como  existe la forma adaptada, el anglicismo es innecesario.  El DRAE &uacute;nicamente acepta la entrada <em>rat&oacute;n</em> para este dispositivo  inform&aacute;tico, pero indica que la palabra s&oacute;lo es usada en Espa&ntilde;a.</p>
      <h2 align="justify" class="Estilo4">Hoy en D&iacute;a </h2>
      <p align="justify" class="Estilo1">Habitualmente se compone de al menos dos botones y otros dispositivos  opcionales como una &laquo;rueda&raquo;, m&aacute;s otros botones secundarios o de distintas  tecnolog&iacute;as como sensores del movimiento que pueden mejorar o hacer m&aacute;s c&oacute;modo  su uso.<br />
        Se suele presentar para manejarse con ambas manos por igual, pero algunos  fabricantes tambi&eacute;n ofrecen modelos &uacute;nicamente para usuarios diestros o zurdos.  Los sistemas operativos pueden tambi&eacute;n facilitar su manejo a todo tipo de  personas, generalmente invirtiendo la funci&oacute;n de los botones.<br />
        <br />
      En los primeros a&ntilde;os de la inform&aacute;tica, el teclado era casi siempre la forma  m&aacute;s popular como dispositivo para la entrada de datos o control de la  computadora. La aparici&oacute;n y &eacute;xito del rat&oacute;n, adem&aacute;s de la posterior evoluci&oacute;n  de los sistemas operativos, logr&oacute; facilitar y mejorar la comodidad, aunque no  releg&oacute; el papel primordial del teclado. A&uacute;n hoy en d&iacute;a, pueden compartir  algunas funciones dejando al usuario que escoja la opci&oacute;n m&aacute;s conveniente a sus  gustos o tareas. Son m&aacute;s modernos.</p>
    <p align="justify" class="Estilo1">&nbsp;</p>
    <table width="839" height="27" border="0">
      <tr>
        <th width="545" scope="col"><div align="left" class="Estilo1"><a href="Página Principal.html">Volver a la P&aacute;gina Principal </a></div></th>
        <th width="86" scope="col"><span class="Estilo1"><a href="Teclado.html">Anterior </a></span></th>
        <th width="129" scope="col"><span class="Estilo1">Siguiente </span></th>
      </tr>
    </table>
    <p align="justify" class="Estilo1">&nbsp;</p></th>
    <th width="41" scope="col">&nbsp;</th>
  </tr>
</table>
</body>
</html>
