<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Tarjeta de Expansión</title>
<style type="text/css">
<!--
.Estilo1 {
	font-family: "Times New Roman", Times, serif;
	font-size: 24px;
	font-weight: bold;
	color: #006666;
}
.Estilo3 {
	font-family: "Times New Roman", Times, serif;
	font-size: 12px;
	color: #006666;
}
.Estilo4 {
	font-family: "Times New Roman", Times, serif;
	font-size: 18px;
	color: #006666;
}
.Estilo5 {color: #006666}
.Estilo6 {
	font-size: 12px;
	font-family: "Times New Roman", Times, serif;
}
body {
	background-image: url(Fondo Negro.jpg);
	background-image: url(Fondo%20Negro.jpg);
}
-->
</style>
</head>

<body>
<table width="947" border="0" bordercolor="#000000">
  <tr>
    <th width="163" scope="col">&nbsp;</th>
    <th width="656" scope="col"><h1 align="center" class="Estilo1">5.- Tarjeta de  Expansi&oacute;n</h1>
      <p align="justify" class="Estilo5"><img src="Tarjeta de Expansi&oacute;n.jpg" width="300" height="225" hspace="200" /></p>
      <p align="justify" class="Estilo5">&nbsp;</p>
      <p align="justify" class="Estilo4">Concepto.</p>
      <p align="justify" class="Estilo3">Las <strong>tarjetas de expansi&oacute;n</strong> son dispositivos con diversos circuitos  integrados y controladores que, insertadas en sus correspondientes <strong>ranuras  de expansi&oacute;n</strong>, sirven para ampliar la capacidad de un ordenador. Las  tarjetas de expansi&oacute;n m&aacute;s comunes sirven para a&ntilde;adir memoria, controladoras de unidad  de disco, controladoras de v&iacute;deo, puertos serie o paralelo y dispositivos de  m&oacute;dem internos. Por lo general, se suelen utilizar indistintamente los t&eacute;rminos  placa y tarjeta para referirse a todas las tarjetas de expansi&oacute;n.<br />
        En la actualidad las tarjetas suelen ser de tipo PCI, PCI Express o AGP.  Como ejemplo de tarjetas que ya no se utilizan tenemos la de tipo Bus ISA. Gracias al avance en la tecnolog&iacute;a USB y a la integraci&oacute;n de audio/video en  la placa base, hoy en d&iacute;a se emplean cada vez menos.</p>
      <p align="justify" class="Estilo4">Historia.</p>
      <p align="justify" class="Estilo3">El primer microordenador en ofrecer una ranura-tipo expansi&oacute;n, tarjeta b&uacute;s  fue el Altair 8800, desarrollado en 1974-1975. Inicialmente, las aplicaciones  de este b&uacute;s eran propietario (como |Apple y Macintosh), pero por 1982  fabricantes de Intel 8080/Zilog computadoras Z80-basado que CP/M corriente  hab&iacute;a establecido alrededor de la norma de S-100. IBM introdujo los XT van en  b&uacute;s, con el primer IBM PC en 1981; se llam&oacute; el b&uacute;s de PC, como el IBM XT,  entonces usando el mismo b&uacute;s (con la excepci&oacute;n ligera,) no ser&iacute;a introducido  hasta las 1983. XT (a.k.a. el 8-pedazo ISA) se reemplaz&oacute; con ISA (a.k.a. el  16-pedazo ISA,) originalmente conocido como Al b&uacute;s, en 1984. Los MCA de IBM van  en autob&uacute;s, desarroll&oacute; para el PS/2 en 1987, era un competidor a ISA, tambi&eacute;n  su plan, pero result&oacute; de favor debido a la aceptaci&oacute;n industria-ancha del ISA y  la autorizaci&oacute;n cerrada de IBM de MCA. EISA, el 16-pedazo extendi&oacute; la versi&oacute;n  de ISA abanderada por Compaq, era com&uacute;n en las tarjetas madres de PC hasta las  1997, cuando Microsoft lo declar&oacute; un subsistema del &quot;legado&quot; en el PC  97 blanco-papel de industria. VESA el Autob&uacute;s Local, un 1990s autob&uacute;s de la  expansi&oacute;n temprano que se at&oacute; inherentemente a los 80486 CPU, se puso obsoleto  (junto con el procesador) cuando Intel lanz&oacute; el Pentium CPU en 1993.</p>
      <p align="justify" class="Estilo3"><br />
        El BUS PCI se introdujo en 1991 como el reemplazo para ISA. La norma (ahora  a versi&oacute;n 3.0) se encuentra hasta el momento en las tarjetas madres de PC.  Intel introdujo que los AGP en 1997 como una soluci&oacute;n de aceleraci&oacute;n videa  especializada. Aunque el termed un autob&uacute;s, AGP apoya s&oacute;lo una sola tarjeta en  un momento. De 2005 el PCI-express ha estado reemplazando PCI y AGP. Esta  norma, aceptado [por qui&eacute;n?] en 2004, instrumentos el protocolo de PCI l&oacute;gico  encima de una interfaz de comunicaci&oacute;n de serie.</p>
      <p align="justify" class="Estilo3"><br />
        Despu&eacute;s de que los S-100 van en autob&uacute;s, este art&iacute;culo sobre las menciones  s&oacute;lo autobuses usaron adelante IBM-compatible/Windows-Intel PC. M&aacute;s otras  l&iacute;neas de la computadora que no eran IBM compatible, mientras incluyendo  aqu&eacute;llos de Tandy, Comodoro, Amiga, y Atari, ofreci&oacute; sus propios autobuses de  la expansi&oacute;n. Incluso muchas consolas listas videas, como el Sega G&eacute;nesis, los  autobuses de la expansi&oacute;n incluido; por lo menos en el caso del G&eacute;nesis, el  autob&uacute;s de la expansi&oacute;n era propietario, y de hecho las hendeduras del cartucho  de muchos cartucho basaron las consolas (no incluso el Atari 2600) calificar&iacute;a  como los autobuses de la expansi&oacute;n, cuando ellos expusieron los dos le&iacute;dos y  escriben capacidades del autob&uacute;s interior del sistema. Sin embargo, los m&oacute;dulos  de la expansi&oacute;n ataron a estas interfazs, aunque funcionalmente igual que las  tarjetas de la expansi&oacute;n, no es t&eacute;cnicamente la expansi&oacute;n pone en tarjeta,  debido a su formulario f&iacute;sico /<br />
    Para sus 1000 EX y 1000 HX planea, la Computadora de Tandy dise&ntilde;&oacute; la M&Aacute;S interfaz de la expansi&oacute;n,  una adaptaci&oacute;n del XT-autob&uacute;s las tarjetas de apoyo de un factor del formulario  m&aacute;s peque&ntilde;o. Porque es el&eacute;ctricamente compatible con el autob&uacute;s de XT (a.k.a.  el 8-pedazo ISA o XT-ISA,) un adaptador pasivo puede hacerse conectar las  tarjetas de XT a un M&Aacute;S conector de la expansi&oacute;n. Otro rasgo de tarjetas de la VENTAJA es que ellos son  los stackable. Otro autob&uacute;s que ofreci&oacute; los m&oacute;dulos de expansi&oacute;n de stackable  era el autob&uacute;s del &quot;sidecar&quot; usado por el IBM PCjr. Esto puede haber  sido el&eacute;ctricamente igual que o similar al autob&uacute;s de XT; ten&iacute;a un poco de  similitudes el m&aacute;s ciertamente desde ambos esencialmente expuesto la direcci&oacute;n  del 8088 CPU y autobuses de los datos, con alg&uacute;n buffering y latching, la suma  de interrupciones y DMA proporcionada por Intel agregar-adelante las astillas,  y unos descubrimiento de falta de sistema linea (Power Good, el Cheque de  Memoria, el I/O Cauce Cheque.) De nuevo, los sidecars de PCjr no son  t&eacute;cnicamente la expansi&oacute;n pone en tarjeta, pero m&oacute;dulos de la expansi&oacute;n, con la  &uacute;nica diferencia que es que el sidecar es una tarjeta de la expansi&oacute;n adjuntada  en una caja pl&aacute;stica (con agujeros que exponen los conectores.)</p>
    <p align="justify" class="Estilo3">&nbsp;</p>
    <p align="justify" class="Estilo3">&nbsp;</p>
    <table width="681" border="0" bordercolor="#FFFFFF">
      <tr>
        <th width="487" scope="col"><div align="left"><span class="Estilo6"><a href="P&aacute;gina Principal.html">Volver a la P&aacute;gina Principal </a></span></div></th>
        <th width="68" scope="col"><span class="Estilo3"><a href="Memoria RAM.html">Anterior</a></span></th>
        <th width="112" scope="col"><span class="Estilo3"><a href="Fuente de Alimentaci&oacute;n.html">Siguiente</a></span></th>
      </tr>
    </table>    <p align="justify" class="Estilo3">&nbsp;</p></th>
    <th width="106" scope="col">&nbsp;</th>
  </tr>
</table>
</body>
</html>
